[
    {
        "slug": "naija-prep-ai",
        "title": "Naija Prep AI",
        "description": "An AI-powered educational preparation platform for Nigeria. Features intelligent learning assistance, personalized study plans, and comprehensive exam preparation tools powered by advanced AI technology.",
        "tags": [
            "Next.js",
            "TypeScript",
            "AI/ML",
            "Education",
            "Vercel"
        ],
        "image": "/images/naija-prep-ai.png",
        "url": "https://naija-prep-ai.vercel.app/",
        "content": "Naija Prep AI is an innovative AI-powered educational platform designed to help students in Nigeria prepare for exams and improve their learning outcomes. The platform leverages advanced artificial intelligence to provide personalized study assistance, generate practice questions, and offer intelligent learning recommendations. Built with modern web technologies, it delivers a seamless user experience with real-time AI interactions and comprehensive educational resources tailored to the Nigerian curriculum."
    },
    {
        "slug": "ethan-mercy-foundation",
        "title": "Ethan-Mercy Foundation",
        "description": "A nonprofit foundation website providing hope and restoration services. Features donation integration, event management, and volunteer registration.",
        "tags": [
            "Next.js",
            "TypeScript",
            "Tailwind CSS",
            "Nonprofit"
        ],
        "image": "/images/ethan-mercy-foundation.png",
        "url": "https://ethanmercy.org/",
        "content": "Ethan-Mercy Foundation is a nonprofit organization dedicated to providing hope and restoration to communities. The website features a modern, accessible design with donation capabilities, event management, and volunteer registration systems."
    },
    {
        "slug": "kings-court-schools",
        "title": "King's Court Schools",
        "description": "A comprehensive school website featuring academic programs, admissions, news, and parent portal integration for King's Court Schools in Makurdi.",
        "tags": [
            "Next.js",
            "React",
            "Tailwind CSS",
            "Education"
        ],
        "image": "/images/kings-court-schools.png",
        "url": "http://kingscourtschoolsmkd.com/",
        "content": "King's Court Schools website provides a complete digital presence for the educational institution, including information about academic programs, admissions process, school news, and integration with parent communication systems."
    },
    {
        "slug": "frilife-media",
        "title": "Frilife Media",
        "description": "A modern media company website showcasing services, awards, and portfolio. Features newsletter subscription, social media integration, and a comprehensive dashboard.",
        "tags": [
            "React",
            "Next.js",
            "Tailwind CSS",
            "Media"
        ],
        "image": "/images/frilife-media.png",
        "url": "https://frilifemedia.com/",
        "content": "Frilife Media is a media company website featuring their services, awards, and portfolio. The platform includes newsletter subscriptions, social media integration, and a comprehensive dashboard for managing content and client interactions."
    },
    {
        "slug": "multi-vendor-cbt-platform",
        "title": "Multi-Vendor CBT Platform",
        "description": "A comprehensive Computer-Based Testing platform for schools. Features secure exam management, multi-vendor support, real-time analytics, and scalable architecture for modern education.",
        "tags": [
            "Next.js",
            "TypeScript",
            "PostgreSQL",
            "Education Tech"
        ],
        "image": "/images/multi-vendor-cbt-platform.png",
        "url": "https://school-management-app-zeta.vercel.app/",
        "content": "The Multi-Vendor CBT Platform transforms education with a comprehensive Computer-Based Testing solution. The platform offers secure exam management, supports multiple vendors, provides real-time analytics, and is designed for scalability in modern educational environments."
    },
    {
        "slug": "fuel-go-nigeria",
        "title": "FuelGo Nigeria",
        "description": "A fuel delivery platform for Nigeria. Features real-time fuel price comparison, vendor search by location, fuel delivery ordering, and fleet management services.",
        "tags": [
            "React",
            "Node.js",
            "MongoDB",
            "E-commerce"
        ],
        "image": "/images/fuel-go-nigeria.png",
        "url": "https://fuel-go-nigeria-iuuf.vercel.app/",
        "content": "FuelGo Nigeria is a comprehensive fuel delivery platform that helps users find the best fuel prices, compare vendors, and order fuel delivery to their location. The platform includes features for fleet management, fuel cards, and price alerts."
    },
    {
        "slug": "chawgo",
        "title": "ChawGo",
        "description": "A food delivery platform with comprehensive dashboard management. Features order tracking, vendor management, real-time updates, and analytics for both customers and vendors. Available on web, Android, and iOS.",
        "tags": [
            "Next.js",
            "TypeScript",
            "MongoDB",
            "React Native",
            "Food Delivery",
            "Mobile App"
        ],
        "image": "/images/chawgo.png",
        "url": "https://chawgo-one.vercel.app/dashboard",
        "androidUrl": "",
        "iosUrl": "",
        "content": "ChawGo is a modern food delivery platform featuring a comprehensive dashboard for managing orders, vendors, and analytics. The platform provides real-time order tracking, vendor management tools, and detailed analytics for both customers and business owners. Available as a web application and native mobile apps for both Android and iOS platforms."
    }
]
